
# Efinity Interface Designer SDC
# Version: 2023.1.150.5.11
# Date: 2023-11-14 13:01

# Copyright (C) 2017 - 2023 Efinix Inc. All rights reserved.

# Device: Ti60F225
# Project: DDR3_MC
# Timing Model: C4 (final)

# Oscillator Constraints
########################
create_clock -period 25 [get_ports {osc_clk}]

# PLL Constraints
#################
create_clock -period 2.5000 tdqss_clk
create_clock -period 5.0000 core_clk
create_clock -period 2.5000 tac_clk
create_clock -waveform {0.6250 1.8750} -period 2.5000 twd_clk
create_clock -period 10.0000 DDR3_PLL_CLKOUT4
create_clock -period 10.0000 mipi_fb
create_clock -waveform {0.9375 2.1875} -period 2.5000 i_mipi_txc_sclk
create_clock -waveform {0.3125 1.5625} -period 2.5000 i_mipi_txd_sclk
create_clock -period 10.0000 i_mipi_tx_pclk
create_clock -period 10.0000 sys_clk
create_clock -period 8.0000 clk_125m
create_clock -period 100.0000 clk_10m
create_clock -period 17.0000 i_sysclk_div_2
create_clock -period 3.3670 hdmi_rx_slow_clk_2x
create_clock -waveform {0.1684 0.8418} -period 1.3468 hdmi_rx_fast_clk
create_clock -period 1.3468 hdmi_tx_fast_clk
create_clock -period 6.7340 hdmi_rx_slow_clk

# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {nrst}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {nrst}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {uart_rx}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {uart_rx}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {b_led[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {b_led[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {b_led[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {b_led[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LCD_POWER}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LCD_POWER}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {o_lcd_rstn}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {o_lcd_rstn}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {phy_rst_n}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {phy_rst_n}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {phy_rst_n1}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {phy_rst_n1}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {uart_tx}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {uart_tx}]

# JTAG Constraints
####################
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_TCK}]
set_output_delay -clock jtag_inst1_TCK -max 0.117 [get_ports {jtag_inst1_TDO}]
set_output_delay -clock jtag_inst1_TCK -min -0.075 [get_ports {jtag_inst1_TDO}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.243 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.162 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.337 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.225 [get_ports {jtag_inst1_SHIFT}]
# JTAG Constraints (extra... not used by current Efinity debug tools)
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_DRCK}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_RUNTEST}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_RUNTEST}]
# Create separate clock groups for JTAG clocks. Remove DRCK clock from the list below if it is not defined.
# set_clock_groups -asynchronous -group {jtag_inst1_TCK jtag_inst1_DRCK}

# HSIO GPIO Constraints
#########################
create_clock -period <USER_PERIOD> [get_ports {clk_25m}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {HDMI_5V_N}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {HDMI_5V_N}]
set_input_delay -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~146}] -max 0.414 [get_ports {rx_dv_LO rx_dv_HI}]
set_input_delay -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~146}] -min 0.276 [get_ports {rx_dv_LO rx_dv_HI}]
set_input_delay -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~293}] -max 0.414 [get_ports {rx_dv1_LO rx_dv1_HI}]
set_input_delay -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~293}] -min 0.276 [get_ports {rx_dv1_LO rx_dv1_HI}]
create_clock -period <USER_PERIOD> [get_ports {rxc}]
create_clock -period <USER_PERIOD> [get_ports {rxc1}]
set_input_delay -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~277}] -max 0.414 [get_ports {rxd1_LO[0] rxd1_HI[0]}]
set_input_delay -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~277}] -min 0.276 [get_ports {rxd1_LO[0] rxd1_HI[0]}]
set_input_delay -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~278}] -max 0.414 [get_ports {rxd1_LO[1] rxd1_HI[1]}]
set_input_delay -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~278}] -min 0.276 [get_ports {rxd1_LO[1] rxd1_HI[1]}]
set_input_delay -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~267}] -max 0.414 [get_ports {rxd1_LO[2] rxd1_HI[2]}]
set_input_delay -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~267}] -min 0.276 [get_ports {rxd1_LO[2] rxd1_HI[2]}]
set_input_delay -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~222}] -max 0.414 [get_ports {rxd1_LO[3] rxd1_HI[3]}]
set_input_delay -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~222}] -min 0.276 [get_ports {rxd1_LO[3] rxd1_HI[3]}]
set_input_delay -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~129}] -max 0.414 [get_ports {rxd_lo_i[0] rxd_hi_i[0]}]
set_input_delay -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~129}] -min 0.276 [get_ports {rxd_lo_i[0] rxd_hi_i[0]}]
set_input_delay -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~113}] -max 0.414 [get_ports {rxd_lo_i[1] rxd_hi_i[1]}]
set_input_delay -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~113}] -min 0.276 [get_ports {rxd_lo_i[1] rxd_hi_i[1]}]
set_input_delay -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~12}] -max 0.414 [get_ports {rxd_lo_i[2] rxd_hi_i[2]}]
set_input_delay -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~12}] -min 0.276 [get_ports {rxd_lo_i[2] rxd_hi_i[2]}]
set_input_delay -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~96}] -max 0.414 [get_ports {rxd_lo_i[3] rxd_hi_i[3]}]
set_input_delay -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~96}] -min 0.276 [get_ports {rxd_lo_i[3] rxd_hi_i[3]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~95}] -max 0.263 [get_ports {addr[0]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~95}] -min -0.140 [get_ports {addr[0]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~36}] -max 0.263 [get_ports {addr[1]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~36}] -min -0.140 [get_ports {addr[1]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~70}] -max 0.263 [get_ports {addr[2]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~70}] -min -0.140 [get_ports {addr[2]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~50~1}] -max 0.263 [get_ports {addr[3]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~50~1}] -min -0.140 [get_ports {addr[3]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~25}] -max 0.263 [get_ports {addr[4]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~25}] -min -0.140 [get_ports {addr[4]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~142~1}] -max 0.263 [get_ports {addr[5]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~142~1}] -min -0.140 [get_ports {addr[5]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~59}] -max 0.263 [get_ports {addr[6]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~59}] -min -0.140 [get_ports {addr[6]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~110}] -max 0.263 [get_ports {addr[7]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~110}] -min -0.140 [get_ports {addr[7]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~26}] -max 0.263 [get_ports {addr[8]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~26}] -min -0.140 [get_ports {addr[8]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~127}] -max 0.263 [get_ports {addr[9]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~127}] -min -0.140 [get_ports {addr[9]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~138}] -max 0.263 [get_ports {addr[10]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~138}] -min -0.140 [get_ports {addr[10]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~60}] -max 0.263 [get_ports {addr[11]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~60}] -min -0.140 [get_ports {addr[11]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~35}] -max 0.263 [get_ports {addr[12]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~35}] -min -0.140 [get_ports {addr[12]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~71}] -max 0.263 [get_ports {addr[13]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~71}] -min -0.140 [get_ports {addr[13]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~109}] -max 0.263 [get_ports {addr[14]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~109}] -min -0.140 [get_ports {addr[14]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~143~1}] -max 0.263 [get_ports {addr[15]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~143~1}] -min -0.140 [get_ports {addr[15]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~74~1}] -max 0.263 [get_ports {ba[0]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~74~1}] -min -0.140 [get_ports {ba[0]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~132~1}] -max 0.263 [get_ports {ba[1]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~132~1}] -min -0.140 [get_ports {ba[1]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~126}] -max 0.263 [get_ports {ba[2]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~126}] -min -0.140 [get_ports {ba[2]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~49}] -max 0.263 [get_ports {cas}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~49}] -min -0.140 [get_ports {cas}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~123~1}] -max 0.263 [get_ports {cke}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~123~1}] -min -0.140 [get_ports {cke}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~95~1}] -max 0.263 [get_ports {cs}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~95~1}] -min -0.140 [get_ports {cs}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~131~1}] -max 0.263 [get_ports {o_dm_lo[0] o_dm_hi[0]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~131~1}] -min -0.140 [get_ports {o_dm_lo[0] o_dm_hi[0]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~83~1}] -max 0.263 [get_ports {o_dm_lo[1] o_dm_hi[1]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~83~1}] -min -0.140 [get_ports {o_dm_lo[1] o_dm_hi[1]}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~170}] -max 0.263 [get_ports {hdmi_tx_clk_n_LO hdmi_tx_clk_n_HI}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~170}] -min -0.140 [get_ports {hdmi_tx_clk_n_LO hdmi_tx_clk_n_HI}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~171}] -max 0.263 [get_ports {hdmi_tx_clk_p_LO hdmi_tx_clk_p_HI}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~171}] -min -0.140 [get_ports {hdmi_tx_clk_p_LO hdmi_tx_clk_p_HI}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~210}] -max 0.263 [get_ports {hdmi_tx_data_n_LO[0] hdmi_tx_data_n_HI[0]}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~210}] -min -0.140 [get_ports {hdmi_tx_data_n_LO[0] hdmi_tx_data_n_HI[0]}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~182}] -max 0.263 [get_ports {hdmi_tx_data_n_LO[1] hdmi_tx_data_n_HI[1]}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~182}] -min -0.140 [get_ports {hdmi_tx_data_n_LO[1] hdmi_tx_data_n_HI[1]}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~195}] -max 0.263 [get_ports {hdmi_tx_data_n_LO[2] hdmi_tx_data_n_HI[2]}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~195}] -min -0.140 [get_ports {hdmi_tx_data_n_LO[2] hdmi_tx_data_n_HI[2]}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~211}] -max 0.263 [get_ports {hdmi_tx_data_p_LO[0] hdmi_tx_data_p_HI[0]}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~211}] -min -0.140 [get_ports {hdmi_tx_data_p_LO[0] hdmi_tx_data_p_HI[0]}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~183}] -max 0.263 [get_ports {hdmi_tx_data_p_LO[1] hdmi_tx_data_p_HI[1]}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~183}] -min -0.140 [get_ports {hdmi_tx_data_p_LO[1] hdmi_tx_data_p_HI[1]}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~196}] -max 0.263 [get_ports {hdmi_tx_data_p_LO[2] hdmi_tx_data_p_HI[2]}]
set_output_delay -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~196}] -min -0.140 [get_ports {hdmi_tx_data_p_LO[2] hdmi_tx_data_p_HI[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {HPD_N}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {HPD_N}]
set_output_delay -clock clk_10m -reference_pin [get_ports {clk_10m~CLKOUT~1~195}] -max 0.263 [get_ports {mdc_o_LO mdc_o_HI}]
set_output_delay -clock clk_10m -reference_pin [get_ports {clk_10m~CLKOUT~1~195}] -min -0.140 [get_ports {mdc_o_LO mdc_o_HI}]
set_output_delay -clock clk_10m -reference_pin [get_ports {clk_10m~CLKOUT~1~181}] -max 0.263 [get_ports {mdc_o1_LO mdc_o1_HI}]
set_output_delay -clock clk_10m -reference_pin [get_ports {clk_10m~CLKOUT~1~181}] -min -0.140 [get_ports {mdc_o1_LO mdc_o1_HI}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~73~1}] -max 0.263 [get_ports {odt}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~73~1}] -min -0.140 [get_ports {odt}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~48}] -max 0.263 [get_ports {ras}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~48}] -min -0.140 [get_ports {ras}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~139}] -max 0.263 [get_ports {reset}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~139}] -min -0.140 [get_ports {reset}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~15}] -max 0.263 [get_ports {tx_en_o_LO tx_en_o_HI}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~15}] -min -0.140 [get_ports {tx_en_o_LO tx_en_o_HI}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~223}] -max 0.263 [get_ports {tx_en_o1_LO tx_en_o1_HI}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~223}] -min -0.140 [get_ports {tx_en_o1_LO tx_en_o1_HI}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~130}] -max 0.263 [get_ports {txc_lo_o txc_hi_o}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~130}] -min -0.140 [get_ports {txc_lo_o txc_hi_o}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~268}] -max 0.263 [get_ports {txc1_LO txc1_HI}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~268}] -min -0.140 [get_ports {txc1_LO txc1_HI}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~257}] -max 0.263 [get_ports {txd1_LO[0] txd1_HI[0]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~257}] -min -0.140 [get_ports {txd1_LO[0] txd1_HI[0]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~245}] -max 0.263 [get_ports {txd1_LO[1] txd1_HI[1]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~245}] -min -0.140 [get_ports {txd1_LO[1] txd1_HI[1]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~246}] -max 0.263 [get_ports {txd1_LO[2] txd1_HI[2]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~246}] -min -0.140 [get_ports {txd1_LO[2] txd1_HI[2]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~171}] -max 0.263 [get_ports {txd1_LO[3] txd1_HI[3]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~171}] -min -0.140 [get_ports {txd1_LO[3] txd1_HI[3]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~114}] -max 0.263 [get_ports {txd_lo_o[0] txd_hi_o[0]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~114}] -min -0.140 [get_ports {txd_lo_o[0] txd_hi_o[0]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~97}] -max 0.263 [get_ports {txd_lo_o[1] txd_hi_o[1]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~97}] -min -0.140 [get_ports {txd_lo_o[1] txd_hi_o[1]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~206}] -max 0.263 [get_ports {txd_lo_o[2] txd_hi_o[2]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~206}] -min -0.140 [get_ports {txd_lo_o[2] txd_hi_o[2]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~207}] -max 0.263 [get_ports {txd_lo_o[3] txd_hi_o[3]}]
set_output_delay -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~207}] -min -0.140 [get_ports {txd_lo_o[3] txd_hi_o[3]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~94}] -max 0.263 [get_ports {we}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~94}] -min -0.140 [get_ports {we}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~148~1}] -max 0.414 [get_ports {i_dq_lo[0] i_dq_hi[0]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~148~1}] -min 0.276 [get_ports {i_dq_lo[0] i_dq_hi[0]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~150~1}] -max 0.263 [get_ports {o_dq_lo[0] o_dq_hi[0]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~150~1}] -min -0.140 [get_ports {o_dq_lo[0] o_dq_hi[0]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~150~1}] -max 0.263 [get_ports {o_dq_oe[0]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~150~1}] -min -0.140 [get_ports {o_dq_oe[0]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~157~1}] -max 0.414 [get_ports {i_dq_lo[1] i_dq_hi[1]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~157~1}] -min 0.276 [get_ports {i_dq_lo[1] i_dq_hi[1]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~159~1}] -max 0.263 [get_ports {o_dq_lo[1] o_dq_hi[1]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~159~1}] -min -0.140 [get_ports {o_dq_lo[1] o_dq_hi[1]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~159~1}] -max 0.263 [get_ports {o_dq_oe[1]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~159~1}] -min -0.140 [get_ports {o_dq_oe[1]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~164~1}] -max 0.414 [get_ports {i_dq_lo[2] i_dq_hi[2]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~164~1}] -min 0.276 [get_ports {i_dq_lo[2] i_dq_hi[2]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~166~1}] -max 0.263 [get_ports {o_dq_lo[2] o_dq_hi[2]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~166~1}] -min -0.140 [get_ports {o_dq_lo[2] o_dq_hi[2]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~166~1}] -max 0.263 [get_ports {o_dq_oe[2]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~166~1}] -min -0.140 [get_ports {o_dq_oe[2]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~149~1}] -max 0.414 [get_ports {i_dq_lo[3] i_dq_hi[3]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~149~1}] -min 0.276 [get_ports {i_dq_lo[3] i_dq_hi[3]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~151~1}] -max 0.263 [get_ports {o_dq_lo[3] o_dq_hi[3]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~151~1}] -min -0.140 [get_ports {o_dq_lo[3] o_dq_hi[3]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~151~1}] -max 0.263 [get_ports {o_dq_oe[3]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~151~1}] -min -0.140 [get_ports {o_dq_oe[3]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~189~1}] -max 0.414 [get_ports {i_dq_lo[4] i_dq_hi[4]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~189~1}] -min 0.276 [get_ports {i_dq_lo[4] i_dq_hi[4]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~191~1}] -max 0.263 [get_ports {o_dq_lo[4] o_dq_hi[4]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~191~1}] -min -0.140 [get_ports {o_dq_lo[4] o_dq_hi[4]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~191~1}] -max 0.263 [get_ports {o_dq_oe[4]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~191~1}] -min -0.140 [get_ports {o_dq_oe[4]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~156~1}] -max 0.414 [get_ports {i_dq_lo[5] i_dq_hi[5]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~156~1}] -min 0.276 [get_ports {i_dq_lo[5] i_dq_hi[5]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~158~1}] -max 0.263 [get_ports {o_dq_lo[5] o_dq_hi[5]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~158~1}] -min -0.140 [get_ports {o_dq_lo[5] o_dq_hi[5]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~158~1}] -max 0.263 [get_ports {o_dq_oe[5]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~158~1}] -min -0.140 [get_ports {o_dq_oe[5]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~165~1}] -max 0.414 [get_ports {i_dq_lo[6] i_dq_hi[6]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~165~1}] -min 0.276 [get_ports {i_dq_lo[6] i_dq_hi[6]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~167~1}] -max 0.263 [get_ports {o_dq_lo[6] o_dq_hi[6]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~167~1}] -min -0.140 [get_ports {o_dq_lo[6] o_dq_hi[6]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~167~1}] -max 0.263 [get_ports {o_dq_oe[6]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~167~1}] -min -0.140 [get_ports {o_dq_oe[6]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~188~1}] -max 0.414 [get_ports {i_dq_lo[7] i_dq_hi[7]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~188~1}] -min 0.276 [get_ports {i_dq_lo[7] i_dq_hi[7]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~190~1}] -max 0.263 [get_ports {o_dq_lo[7] o_dq_hi[7]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~190~1}] -min -0.140 [get_ports {o_dq_lo[7] o_dq_hi[7]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~190~1}] -max 0.263 [get_ports {o_dq_oe[7]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~190~1}] -min -0.140 [get_ports {o_dq_oe[7]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~82~1}] -max 0.414 [get_ports {i_dq_lo[8] i_dq_hi[8]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~82~1}] -min 0.276 [get_ports {i_dq_lo[8] i_dq_hi[8]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~84~1}] -max 0.263 [get_ports {o_dq_lo[8] o_dq_hi[8]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~84~1}] -min -0.140 [get_ports {o_dq_lo[8] o_dq_hi[8]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~84~1}] -max 0.263 [get_ports {o_dq_oe[8]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~84~1}] -min -0.140 [get_ports {o_dq_oe[8]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~39~1}] -max 0.414 [get_ports {i_dq_lo[9] i_dq_hi[9]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~39~1}] -min 0.276 [get_ports {i_dq_lo[9] i_dq_hi[9]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~41~1}] -max 0.263 [get_ports {o_dq_lo[9] o_dq_hi[9]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~41~1}] -min -0.140 [get_ports {o_dq_lo[9] o_dq_hi[9]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~41~1}] -max 0.263 [get_ports {o_dq_oe[9]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~41~1}] -min -0.140 [get_ports {o_dq_oe[9]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~22~1}] -max 0.414 [get_ports {i_dq_lo[10] i_dq_hi[10]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~22~1}] -min 0.276 [get_ports {i_dq_lo[10] i_dq_hi[10]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~24~1}] -max 0.263 [get_ports {o_dq_lo[10] o_dq_hi[10]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~24~1}] -min -0.140 [get_ports {o_dq_lo[10] o_dq_hi[10]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~24~1}] -max 0.263 [get_ports {o_dq_oe[10]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~24~1}] -min -0.140 [get_ports {o_dq_oe[10]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~92~1}] -max 0.414 [get_ports {i_dq_lo[11] i_dq_hi[11]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~92~1}] -min 0.276 [get_ports {i_dq_lo[11] i_dq_hi[11]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~94~1}] -max 0.263 [get_ports {o_dq_lo[11] o_dq_hi[11]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~94~1}] -min -0.140 [get_ports {o_dq_lo[11] o_dq_hi[11]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~94~1}] -max 0.263 [get_ports {o_dq_oe[11]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~94~1}] -min -0.140 [get_ports {o_dq_oe[11]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~23~1}] -max 0.414 [get_ports {i_dq_lo[12] i_dq_hi[12]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~23~1}] -min 0.276 [get_ports {i_dq_lo[12] i_dq_hi[12]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~25~1}] -max 0.263 [get_ports {o_dq_lo[12] o_dq_hi[12]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~25~1}] -min -0.140 [get_ports {o_dq_lo[12] o_dq_hi[12]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~25~1}] -max 0.263 [get_ports {o_dq_oe[12]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~25~1}] -min -0.140 [get_ports {o_dq_oe[12]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~38~1}] -max 0.414 [get_ports {i_dq_lo[13] i_dq_hi[13]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~38~1}] -min 0.276 [get_ports {i_dq_lo[13] i_dq_hi[13]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~40~1}] -max 0.263 [get_ports {o_dq_lo[13] o_dq_hi[13]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~40~1}] -min -0.140 [get_ports {o_dq_lo[13] o_dq_hi[13]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~40~1}] -max 0.263 [get_ports {o_dq_oe[13]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~40~1}] -min -0.140 [get_ports {o_dq_oe[13]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~11~1}] -max 0.414 [get_ports {i_dq_lo[14] i_dq_hi[14]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~11~1}] -min 0.276 [get_ports {i_dq_lo[14] i_dq_hi[14]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~13~1}] -max 0.263 [get_ports {o_dq_lo[14] o_dq_hi[14]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~13~1}] -min -0.140 [get_ports {o_dq_lo[14] o_dq_hi[14]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~13~1}] -max 0.263 [get_ports {o_dq_oe[14]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~13~1}] -min -0.140 [get_ports {o_dq_oe[14]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~12~1}] -max 0.414 [get_ports {i_dq_lo[15] i_dq_hi[15]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~12~1}] -min 0.276 [get_ports {i_dq_lo[15] i_dq_hi[15]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~14~1}] -max 0.263 [get_ports {o_dq_lo[15] o_dq_hi[15]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~14~1}] -min -0.140 [get_ports {o_dq_lo[15] o_dq_hi[15]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~14~1}] -max 0.263 [get_ports {o_dq_oe[15]}]
set_output_delay -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~14~1}] -min -0.140 [get_ports {o_dq_oe[15]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~172~1}] -max 0.414 [get_ports {i_dqs_lo[0] i_dqs_hi[0]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~172~1}] -min 0.276 [get_ports {i_dqs_lo[0] i_dqs_hi[0]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~174~1}] -max 0.263 [get_ports {o_dqs_lo[0] o_dqs_hi[0]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~174~1}] -min -0.140 [get_ports {o_dqs_lo[0] o_dqs_hi[0]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~174~1}] -max 0.263 [get_ports {o_dqs_oe[0]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~174~1}] -min -0.140 [get_ports {o_dqs_oe[0]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~175~1}] -max 0.263 [get_ports {o_dqs_n_oe[0]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~175~1}] -min -0.140 [get_ports {o_dqs_n_oe[0]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~30~1}] -max 0.414 [get_ports {i_dqs_lo[1] i_dqs_hi[1]}]
set_input_delay -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~30~1}] -min 0.276 [get_ports {i_dqs_lo[1] i_dqs_hi[1]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~32~1}] -max 0.263 [get_ports {o_dqs_lo[1] o_dqs_hi[1]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~32~1}] -min -0.140 [get_ports {o_dqs_lo[1] o_dqs_hi[1]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~32~1}] -max 0.263 [get_ports {o_dqs_oe[1]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~32~1}] -min -0.140 [get_ports {o_dqs_oe[1]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~33~1}] -max 0.263 [get_ports {o_dqs_n_oe[1]}]
set_output_delay -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~33~1}] -min -0.140 [get_ports {o_dqs_n_oe[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {FPGA_HDMI_SCL_IN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {FPGA_HDMI_SCL_IN}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {FPGA_HDMI_SCL_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {FPGA_HDMI_SCL_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {FPGA_HDMI_SCL_OE}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {FPGA_HDMI_SCL_OE}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {FPGA_HDMI_SDA_IN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {FPGA_HDMI_SDA_IN}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {FPGA_HDMI_SDA_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {FPGA_HDMI_SDA_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {FPGA_HDMI_SDA_OE}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {FPGA_HDMI_SDA_OE}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mdio_i}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mdio_i}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mdio_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mdio_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mdio_oe}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mdio_oe}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mdio_io1_IN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mdio_io1_IN}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mdio_io1_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mdio_io1_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mdio_io1_OE}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mdio_io1_OE}]

# LVDS Rx Constraints
#######################
set_input_delay -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~258}] -max 0.512 [get_ports {hdmi_rx_d0_RX_DATA[*]}]
set_input_delay -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~258}] -min 0.342 [get_ports {hdmi_rx_d0_RX_DATA[*]}]
set_input_delay -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~283}] -max 0.512 [get_ports {hdmi_rx_d1_RX_DATA[*]}]
set_input_delay -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~283}] -min 0.342 [get_ports {hdmi_rx_d1_RX_DATA[*]}]
set_input_delay -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~271}] -max 0.512 [get_ports {hdmi_rx_d2_RX_DATA[*]}]
set_input_delay -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~271}] -min 0.342 [get_ports {hdmi_rx_d2_RX_DATA[*]}]
set_output_delay -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~258}] -max 0.315 [get_ports {hdmi_rx_d0_RX_RST}]
set_output_delay -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~258}] -min -0.140 [get_ports {hdmi_rx_d0_RX_RST}]
set_output_delay -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~283}] -max 0.315 [get_ports {hdmi_rx_d1_RX_RST}]
set_output_delay -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~283}] -min -0.140 [get_ports {hdmi_rx_d1_RX_RST}]
set_output_delay -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~271}] -max 0.315 [get_ports {hdmi_rx_d2_RX_RST}]
set_output_delay -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~271}] -min -0.140 [get_ports {hdmi_rx_d2_RX_RST}]

# MIPI TX Lane Constraints
############################
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~127~322}] -max 0.378 [get_ports {mipi_dp_clk_HS_OUT[*]}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~127~322}] -min -0.140 [get_ports {mipi_dp_clk_HS_OUT[*]}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~127~322}] -max 0.315 [get_ports {mipi_dp_clk_RST}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~127~322}] -min -0.140 [get_ports {mipi_dp_clk_RST}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~136~322}] -max 0.378 [get_ports {mipi_dp_data0_HS_OUT[*]}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~136~322}] -min -0.140 [get_ports {mipi_dp_data0_HS_OUT[*]}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~136~322}] -max 0.315 [get_ports {mipi_dp_data0_RST}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~136~322}] -min -0.140 [get_ports {mipi_dp_data0_RST}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~88~322}] -max 0.378 [get_ports {mipi_dp_data1_HS_OUT[*]}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~88~322}] -min -0.140 [get_ports {mipi_dp_data1_HS_OUT[*]}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~88~322}] -max 0.315 [get_ports {mipi_dp_data1_RST}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~88~322}] -min -0.140 [get_ports {mipi_dp_data1_RST}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~147~322}] -max 0.378 [get_ports {mipi_dp_data2_HS_OUT[*]}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~147~322}] -min -0.140 [get_ports {mipi_dp_data2_HS_OUT[*]}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~147~322}] -max 0.315 [get_ports {mipi_dp_data2_RST}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~147~322}] -min -0.140 [get_ports {mipi_dp_data2_RST}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~79~322}] -max 0.378 [get_ports {mipi_dp_data3_HS_OUT[*]}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~79~322}] -min -0.140 [get_ports {mipi_dp_data3_HS_OUT[*]}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~79~322}] -max 0.315 [get_ports {mipi_dp_data3_RST}]
set_output_delay -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~79~322}] -min -0.140 [get_ports {mipi_dp_data3_RST}]

# Clockout Interface
######################
# addr[0] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~95}]
# addr[10] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~138}]
# addr[11] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~60}]
# addr[12] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~35}]
# addr[13] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~71}]
# addr[14] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~109}]
# addr[15] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~143~1}]
# addr[1] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~36}]
# addr[2] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~70}]
# addr[3] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~50~1}]
# addr[4] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~25}]
# addr[5] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~142~1}]
# addr[6] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~59}]
# addr[7] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~110}]
# addr[8] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~26}]
# addr[9] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~127}]
# ba[0] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~74~1}]
# ba[1] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~132~1}]
# ba[2] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~126}]
# cas -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~49}]
# cke -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~123~1}]
# cs -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~95~1}]
# dm[0] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~131~1}]
# dm[1] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~83~1}]
# dq[0] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~148~1}]
# dq[0] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~150~1}]
# dq[10] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~22~1}]
# dq[10] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~24~1}]
# dq[11] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~92~1}]
# dq[11] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~94~1}]
# dq[12] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~23~1}]
# dq[12] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~25~1}]
# dq[13] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~38~1}]
# dq[13] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~40~1}]
# dq[14] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~11~1}]
# dq[14] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~13~1}]
# dq[15] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~12~1}]
# dq[15] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~14~1}]
# dq[1] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~157~1}]
# dq[1] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~159~1}]
# dq[2] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~164~1}]
# dq[2] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~166~1}]
# dq[3] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~149~1}]
# dq[3] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~151~1}]
# dq[4] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~189~1}]
# dq[4] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~191~1}]
# dq[5] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~156~1}]
# dq[5] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~158~1}]
# dq[6] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~165~1}]
# dq[6] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~167~1}]
# dq[7] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~188~1}]
# dq[7] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~190~1}]
# dq[8] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~82~1}]
# dq[8] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~84~1}]
# dq[9] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~39~1}]
# dq[9] -clock twd_clk -reference_pin [get_ports {twd_clk~CLKOUT~41~1}]
# dqs[0] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~172~1}]
# dqs[0] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~174~1}]
# dqs[0] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~175~1}]
# dqs[1] -clock tac_clk -reference_pin [get_ports {tac_clk~CLKOUT~30~1}]
# dqs[1] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~32~1}]
# dqs[1] -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~33~1}]
# hdmi_rx_d0 -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~258}]
# hdmi_rx_d1 -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~283}]
# hdmi_rx_d2 -clock hdmi_rx_slow_clk -reference_pin [get_ports {hdmi_rx_slow_clk~CLKOUT~218~271}]
# hdmi_tx_clk_n -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~170}]
# hdmi_tx_clk_p -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~171}]
# hdmi_tx_data_n[0] -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~210}]
# hdmi_tx_data_n[1] -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~182}]
# hdmi_tx_data_n[2] -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~195}]
# hdmi_tx_data_p[0] -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~211}]
# hdmi_tx_data_p[1] -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~183}]
# hdmi_tx_data_p[2] -clock hdmi_tx_fast_clk -reference_pin [get_ports {hdmi_tx_fast_clk~CLKOUT~218~196}]
# mdc_o -clock clk_10m -reference_pin [get_ports {clk_10m~CLKOUT~1~195}]
# mdc_o1 -clock clk_10m -reference_pin [get_ports {clk_10m~CLKOUT~1~181}]
# mipi_dp_clk -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~127~322}]
# mipi_dp_data0 -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~136~322}]
# mipi_dp_data1 -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~88~322}]
# mipi_dp_data2 -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~147~322}]
# mipi_dp_data3 -clock i_mipi_tx_pclk -reference_pin [get_ports {i_mipi_tx_pclk~CLKOUT~79~322}]
# odt -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~73~1}]
# ras -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~48}]
# reset -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~139}]
# rx_dv -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~146}]
# rx_dv1 -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~293}]
# rxd1[0] -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~277}]
# rxd1[1] -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~278}]
# rxd1[2] -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~267}]
# rxd1[3] -clock rxc1 -reference_pin [get_ports {rxc1~CLKOUT~1~222}]
# rxd[0] -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~129}]
# rxd[1] -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~113}]
# rxd[2] -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~12}]
# rxd[3] -clock rxc -reference_pin [get_ports {rxc~CLKOUT~1~96}]
# tx_en_o -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~15}]
# tx_en_o1 -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~223}]
# txc -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~130}]
# txc1 -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~268}]
# txd1[0] -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~257}]
# txd1[1] -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~245}]
# txd1[2] -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~246}]
# txd1[3] -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~171}]
# txd[0] -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~114}]
# txd[1] -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~97}]
# txd[2] -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~206}]
# txd[3] -clock clk_125m -reference_pin [get_ports {clk_125m~CLKOUT~1~207}]
# we -clock tdqss_clk -reference_pin [get_ports {tdqss_clk~CLKOUT~218~94}]
